sdaiGetSchemaInstance(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,Sdai_instS*)
\details
Retrieves a schema instance with a specified name from a specified repository.
\param schemaInstanceName [in] A string that contains the schema instance name.
\param repository         [in] A repository where the function searches for the schema instance by its name.
\returns The schema instance with the specified name.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiSI_NEXS - Schema instance does not exist.
* sdaiSY_ERR - Underlying system error.